# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2 stem
  - [-1, 1, HRPM_PP, [64, 3, 2]] # 1
  - [-1, 1, Conv, [128, 3, 2]]  # 2-P2/4
  - [-1, 3, C2f, [128, True]] # dark2 3
  - [-1, 1, Conv, [256, 3, 2]]  # 4-P3/8
  - [-1, 6, C2f, [256, True]] # dark3 5
  - [-1, 1, Conv, [512, 3, 2]]  # 6-P4/16
  - [-1, 6, C2f, [512, True]] # dark4 7
  - [-1, 1, Conv, [1024, 3, 2]]  # 8-P5/32
  - [-1, 3, C2f, [1024, True]] # 9
  - [-1, 1, SPPF, [1024, 5]]  # 10 dark5



head:
  - [-1, 1, Conv, [512, 1, 1]] # 11
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 12
  - [[-1, 7], 1, Concat, [1]]  # cat backbone P4 13
  - [[3, 13], 1, EEM, [1]] # 14
  - [-1, 3, C2f, [512]]  # 15

  - [-1, 1, Conv, [256, 1, 1]] # 16
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 5], 1, Concat, [1]]  # cat backbone P4 18
  - [[3, 18], 1, EEM, [1]] # 19
  - [-1, 3, C2f, [256]]  # 20
  - [[-1, 5], 1, Concat, [1]] # 21
  - [-1, 1, Conv1x1, [256, 1, 1]] # 22

  - [-1, 1, DBUM, [256, 3, 2]] # 23
  - [[-1, 14], 1, Concat, [1]]  # cat head P4 24
  - [-1, 3, C2f, [512]]  # 25 (P4/16-medium)
  - [[-1, 7], 1, Concat, [1]] # 26
  - [-1, 1, Conv1x1, [512, 1, 1]] # 27

  - [-1, 1, DBUM, [512, 3, 2]] # 28
  - [[-1, 10], 1, Concat, [1]]  # cat head P5 29
  - [-1, 3, C2f, [1024]]  # 30 (P5/32-large)
  - [[-1, 10], 1, Concat, [1]] # 31
  - [-1, 1, Conv1x1, [1024, 1, 1]] # 32

  - [32, 1, SFM_PP_UP, [512]] # 33 s=40
  - [27, 1, SFM_PP_UP, [256]] # 34 s=80
  - [22, 1, SFM_PP_DOWN, [512]] # 35 s=20

  # yolov8x
  # - [[32, 35], 1, MULTIPLE, [640]] # 36
  # - [[27, 33], 1, MULTIPLE, [640]] # 37
  # - [[22, 34], 1, MULTIPLE, [320]] # 38

  # # yolov8l
  # - [[32, 35], 1, MULTIPLE, [512]] # 36
  # - [[27, 33], 1, MULTIPLE, [512]] # 37
  # - [[22, 34], 1, MULTIPLE, [256]] # 38 

  # # yolov8m
  # - [[32, 35], 1, MULTIPLE, [576]] # 36
  # - [[27, 33], 1, MULTIPLE, [384]] # 37
  # - [[22, 34], 1, MULTIPLE, [192]] # 38 

  # yolov8s
  - [[32, 35], 1, MULTIPLE, [512]] # 36
  - [[27, 33], 1, MULTIPLE, [256]] # 37
  - [[22, 34], 1, MULTIPLE, [128]] # 38 

  - [[38, 37, 36], 1, Detect, [nc]]  # Detect(P3, P4, P5)



